w4/w4d3/app/views/cats/_req_tr.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
<tr>
  <% requestor = User.find(req.user_id) %>