w4/w4d3/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["created_at", "2015-07-16 00:17:33.215230"], ["end_date", "2015-07-17"], ["start_date", "2015-07-15"], ["status", "PENDING"], ["updated_at", "2015-07-16 00:17:33.215230"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save