w4/w4d3/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "cats" SET "color" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = 2  [["color", "black"], ["name", "jeff"], ["updated_at", "2015-07-16 00:03:19.601661"]]