w4/w4d3/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-07-15 21:15:31.092590"], ["session_token", "3SJEDjqrB-8ueoULQ_zJQQ"], ["updated_at", "2015-07-15 21:15:31.092590"], ["username", "elgslkjn"]]