w5/w5d1/app/controllers/comments_controller.rb

  def create

    @comment = Comment.new(comment_params)
    new_link = "/#{@comment.commentable_type.tableize}/#{@comment.commentable_id}"
    if @comment.save
---
INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdasdasd"], ["commentable_id", 1], ["commentable_type", 0], ["created_at", "2015-07-20 23:51:00.592641"], ["updated_at", "2015-07-20 23:51:00.592641"]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "to be a baller"], ["updated_at", "2015-07-21 00:41:30.299371"], ["id", 11]]

  def destroy
    @comment = Comment.find(params[:id])
    Comment.find(params[:id]).destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]