w5/w5d1/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("body", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Body1"], ["title", "Title1"], ["user_id", 1], ["created_at", "2015-07-20 21:40:16.761462"], ["updated_at", "2015-07-20 21:40:16.761462"]]

  def update
    @goal = Goal.find(params[:id])
    if @goal.update(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "goals" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["body", "nah"], ["title", "Learn Rspec"], ["updated_at", "2015-07-20 21:55:44.011967"], ["id", 1]]

  def edit
    @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]